import {Component, Input} from '@angular/core';

@Component({
  selector: 'app-area',
  templateUrl: './area.component.html',
  styleUrls: ['./area.component.css']
})
export class AreaComponent {
  @Input() type: any;
  chartOption1 = {
    tooltip: {
      trigger: 'axis'
    },
    legend: {
      data: ['邮件营销', '联盟广告', '视频广告', '直接访问', '搜索引擎']
    },
    toolbox: {
      feature: {
        saveAsImage: {}
      }
    },
    grid: {
      left: '3%',
      right: '4%',
      bottom: '3%',
      containLabel: true
    },
    xAxis: [
      {
        type: 'category',
        boundaryGap: false,
        data: ['周一', '周二', '周三', '周四', '周五', '周六', '周日']
      }
    ],
    yAxis: [
      {
        type: 'value'
      }
    ],
    series: [
      {
        name: '邮件营销',
        type: 'line',
        stack: '总量',
        areaStyle: {normal: {}},
        data: [120, 132, 101, 134, 90, 230, 210]
      },
      {
        name: '联盟广告',
        type: 'line',
        stack: '总量',
        areaStyle: {normal: {}},
        data: [220, 182, 191, 234, 290, 330, 310]
      },
      {
        name: '视频广告',
        type: 'line',
        stack: '总量',
        areaStyle: {normal: {}},
        data: [150, 232, 201, 154, 190, 330, 410]
      },
      {
        name: '直接访问',
        type: 'line',
        stack: '总量',
        areaStyle: {normal: {}},
        data: [320, 332, 301, 334, 390, 330, 320]
      },
      {
        name: '搜索引擎',
        type: 'line',
        stack: '总量',
        label: {
          normal: {
            show: true,
            position: 'top'
          }
        },
        areaStyle: {normal: {}},
        data: [820, 932, 901, 934, 1290, 1330, 1320]
      }
    ]
  };

  chartOption2 = {

    tooltip: {
      trigger: 'axis',
      axisPointer: {
        type: 'line',
        lineStyle: {
          color: 'rgba(0,0,0,0.2)',
          width: 1,
          type: 'solid'
        }
      }
    },

    legend: {
      data: ['River1', 'River2', 'River3', 'River4', 'River5', 'River6']
    },

    singleAxis: {
      top: 50,
      bottom: 50,
      axisTick: {},
      axisLabel: {},
      type: 'time',
      axisPointer: {
        animation: true,
        label: {
          show: true
        }
      },
      splitLine: {
        show: true,
        lineStyle: {
          type: 'dashed',
          opaciRiver2: 0.2
        }
      }
    },

    series: [
      {
        type: 'themeRiver',
        itemStyle: {
          emphasis: {
            shadowBlur: 20,
            shadowColor: 'rgba(0, 0, 0, 0.8)'
          }
        },
        data: [['2015/11/08', 10, 'River1'], ['2015/11/09', 15, 'River1'], ['2015/11/10', 35, 'River1'],
          // ['2015/11/11',38,'River1'],['2015/11/12',22,'River1'],['2015/11/13',16,'River1'],
          ['2015/11/14', 7, 'River1'], ['2015/11/15', 2, 'River1'], ['2015/11/16', 17, 'River1'],
          ['2015/11/17', 33, 'River1'], ['2015/11/18', 40, 'River1'], ['2015/11/19', 32, 'River1'],
          ['2015/11/20', 26, 'River1'], ['2015/11/21', 35, 'River1'], ['2015/11/22', 40, 'River1'],
          ['2015/11/23', 32, 'River1'], ['2015/11/24', 26, 'River1'], ['2015/11/25', 22, 'River1'],
          // ['2015/11/26',16,'River1'],['2015/11/27',22,'River1'],['2015/11/28',10,'River1'],
          ['2015/11/08', 35, 'River2'], ['2015/11/09', 36, 'River2'], ['2015/11/10', 37, 'River2'],
          ['2015/11/11', 22, 'River2'], ['2015/11/12', 24, 'River2'], ['2015/11/13', 26, 'River2'],
          ['2015/11/14', 34, 'River2'], ['2015/11/15', 21, 'River2'], ['2015/11/16', 18, 'River2'],
          ['2015/11/17', 45, 'River2'], ['2015/11/18', 32, 'River2'], ['2015/11/19', 35, 'River2'],
          ['2015/11/20', 30, 'River2'], ['2015/11/21', 28, 'River2'], ['2015/11/22', 27, 'River2'],
          ['2015/11/23', 26, 'River2'], ['2015/11/24', 15, 'River2'], ['2015/11/25', 30, 'River2'],
          ['2015/11/26', 35, 'River2'], ['2015/11/27', 42, 'River2'], ['2015/11/28', 42, 'River2'],
          ['2015/11/08', 21, 'River3'], ['2015/11/09', 25, 'River3'], ['2015/11/10', 27, 'River3'],
          ['2015/11/11', 23, 'River3'], ['2015/11/12', 24, 'River3'], ['2015/11/13', 21, 'River3'],
          ['2015/11/14', 35, 'River3'], ['2015/11/15', 39, 'River3'], ['2015/11/16', 40, 'River3'],
          ['2015/11/17', 36, 'River3'], ['2015/11/18', 33, 'River3'], ['2015/11/19', 43, 'River3'],
          ['2015/11/20', 40, 'River3'], ['2015/11/21', 34, 'River3'], ['2015/11/22', 28, 'River3'],
          // ['2015/11/23',26,'River3'],['2015/11/24',37,'River3'],['2015/11/25',41,'River3'],
          // ['2015/11/26',46,'River3'],['2015/11/27',47,'River3'],['2015/11/28',41,'River3'],
          // ['2015/11/08',10,'River4'],['2015/11/09',15,'River4'],['2015/11/10',35,'River4'],
          // ['2015/11/11',38,'River4'],['2015/11/12',22,'River4'],['2015/11/13',16,'River4'],
          ['2015/11/14', 7, 'River4'], ['2015/11/15', 2, 'River4'], ['2015/11/16', 17, 'River4'],
          ['2015/11/17', 33, 'River4'], ['2015/11/18', 40, 'River4'], ['2015/11/19', 32, 'River4'],
          ['2015/11/20', 26, 'River4'], ['2015/11/21', 35, 'River4'], ['2015/11/22', 40, 'River4'],
          ['2015/11/23', 32, 'River4'], ['2015/11/24', 26, 'River4'], ['2015/11/25', 22, 'River4'],
          ['2015/11/26', 16, 'River4'], ['2015/11/27', 22, 'River4'], ['2015/11/28', 10, 'River4'],
          ['2015/11/08', 10, 'River5'], ['2015/11/09', 15, 'River5'], ['2015/11/10', 35, 'River5'],
          ['2015/11/11', 38, 'River5'], ['2015/11/12', 22, 'River5'], ['2015/11/13', 16, 'River5'],
          ['2015/11/14', 7, 'River5'], ['2015/11/15', 2, 'River5'], ['2015/11/16', 17, 'River5'],
          ['2015/11/17', 33, 'River5'], ['2015/11/18', 40, 'River5'], ['2015/11/19', 32, 'River5'],
          ['2015/11/20', 26, 'River5'], ['2015/11/21', 35, 'River5'], ['2015/11/22', 4, 'River5'],
          ['2015/11/23', 32, 'River5'], ['2015/11/24', 26, 'River5'], ['2015/11/25', 22, 'River5'],
          ['2015/11/26', 16, 'River5'], ['2015/11/27', 22, 'River5'], ['2015/11/28', 10, 'River5'],
          ['2015/11/08', 10, 'River6'], ['2015/11/09', 15, 'River6'], ['2015/11/10', 35, 'River6'],
          ['2015/11/11', 38, 'River6'], ['2015/11/12', 22, 'River6'], ['2015/11/13', 16, 'River6'],
          ['2015/11/14', 7, 'River6'], ['2015/11/15', 2, 'River6'], ['2015/11/16', 17, 'River6'],
          ['2015/11/17', 33, 'River6'], ['2015/11/18', 4, 'River6'], ['2015/11/19', 32, 'River6'],
          ['2015/11/20', 26, 'River6'], ['2015/11/21', 35, 'River6'], ['2015/11/22', 40, 'River6'],
          ['2015/11/23', 32, 'River6'], ['2015/11/24', 26, 'River6'], ['2015/11/25', 22, 'River6'],
          ['2015/11/26', 16, 'River6'], ['2015/11/27', 22, 'River6'], ['2015/11/28', 10, 'River6']]
      }
    ]
  };

}
